{
    "antiquarian":{
        "name": "Antiquarian",
        "desc":"Able to keep track of gathered loot on a quest, the antiquarian is a treasurer of sorts, maintaining the quest-goer’s spoils, and appraising anything they look at.",
        "passives": [
            {
                "name": "Appraisal",
                "desc": "By spending 1 minute, you can assess the exact worth of any object that fits in a 10-foot cube.<br>You may also, at will, replicate the effects of the <em>identify</em> spell as if it were cast as a ritual"
            }
        ],
        "actives": {
            "riskassess": {
                "name": "Risk Assessment",
                "desc": "At the start of your turn, you may choose a number of creatures within 60 feet of you up to your proficiency bonus. For each of those creatures, you may ask the DM three of the following questions about that creature, learning the answer:<br><ul><li>The creature’s AC.</li><li>The creature’s physical ability scores: Strength, Dexterity, and Constitution.</li><li>The creature’s mental ability scores: Intelligence, Wisdom, and Charisma.</li><li>The creature’s damage vulnerabilities.</li><li>The creature’s damage resistances.</li><li>The creature’s damage immunities.</li><li>The creature’s condition immunities.</li><li>Whether the creature has any special senses, what those special senses are, and the distance they reach to.</li><li>If the creature can cast any spells, and the highest level spell available to it.</li></ul>",
                "cost":5,
                "uses": 1
            },
            "shutdown": {
                "name": "Shutdown",
                "desc": "As an action on your turn, you replicate the effects of the <em>dispel magic</em> spell as if it were cast at a level equal to 3 + your proficiency bonus.",
                "cost":15,
                "uses":1
            }
        },
        "requirements": [
            "Proficiency in the Investigation skill, the Guild Artisan Background, or an Intelligence score of 15 or higher."
        ],
        "cost": 0
    },
    "arcanist":{
        "name": "Arcanist",
        "desc": "A staff arcanist acts as the quest-goers’ primary source of magic, either as a defensive, offensive, or utilitarian tool. Arcanists specialise in channelling their spellcasting into beneficial effects and maintaining control over the party.",
        "passives": [
            {
                "name": "Sense Magic",
                "desc": "You can detect any number of magical presences in a 30-foot radius around you. You do not know its source, but a successful DC 15 Intelligence (Arcana) check reveals its school."
            }
        ],
        "actives": {
            "channeltheweave": {
                "name":"Channel the Weave",
                "desc":"As a bonus action on your turn, you channel latent magical energies from around you into a new source of strength. You regain one 1st-level spell slot.<br>As you gain character levels, the level of spell with which you can replenish increases by 1 at 5th, 7th, 9th and 11th. When you use this Role Power at these levels, you may regain a spell slot of a level lower than the spell slot level listed.",
                "cost":15,
                "uses":1
            }
        },
        "requirements": [
            "3rd level or higher in a spellcasting class"
        ],
        "cost": 0
    },
    "defender": {
        "name": "Defender",
        "desc": "Defenders act as front-line protectors of their allies, taking the hits so they don’t have to. The defender is first on the field, and last to go down.",
        "passives": [
            {
                "name": "Endurance",
                "desc": "Whenever a creature rolls damage against you, you reduce that incoming damage by an amount equal to half your proficiency bonus."
            }
        ],
        "actives": {
            "bulwark": {
                "name": "Bulwark",
                "desc": "Whenever a creature within 15 feet of you would suffer damage that is not poison or psychic type from a source that you can see, you may use your reaction, moving up to half your speed to an unoccupied space within 5 feet of the target. The target creature takes no damage and you take half the damage it would have taken otherwise. The target creature can then suffer no additional effects from the damage source.",
                "cost": 10,
                "uses": 1
            }
        },
        "requirements": [
            "Proficiency in heavy armour, AC 18 or higher, or a d12 hit dice"
        ],
        "cost": 0
    },
    "manatarms": {
        "name": "Man-at-Arms",
        "desc": "The man-at-arms marks themselves for their expertise in weaponry, either through maintenance or ability of usage.",
        "passives": [
            {
                "name": "Precise Strikes",
                "desc": "When you roll damage for a weapon attack, treat all rolls of 1 on a damage die as a 2."
            }
        ],
        "actives": {
            "striketrue": {
                "name": "Strike True",
                "desc": "When you make a weapon attack, instead of rolling you can choose to use this Role Power. Treating the result as a critical hit.<br>This power does not affect the die result, preventing interaction with items that require a roll of a 20, such as a <em>vorpal sword</em>.",
                "cost":5,
                "uses":1
            }
        },
        "requirements": [
            "Proficiency in marital weapons or smith’s tools, or a gunsmith’s kit"
        ],
        "cost": 0
    },
    "medic": {
        "name": "Medic",
        "desc": "Medics act as protectors and rejuvenators of a party of quest-goers, able to get their allies back on their feet when in danger.",
        "passives": [
            {
                "name": "Rest and Mend",
                "desc": "During a short rest, the medic can tend to up to two creatures, aiding them in restoring their hit points. Whenever one of the chosen creatures rolls hit dice to recover lost hit points during this rest, that creature rolls each expended hit dice twice, taking the higher result."
            }
        ],
        "actives": {
            "treatmentundertrial": {
                "name": "Treatment Under Trial",
                "desc": "As a bonus action on your turn, you perform emergency treatment on a creature you can touch. The target can expend a number of hit dice equal to its proficiency bonus, regaining hit points as if it spent them during a short rest.<br>Creatures that recover hit points in this way gain the benefits of your Rest and Mend Role Effect.",
                "cost": 10,
                "uses": 1
            }
        },
        "requirements": [
            "Proficiency in the Medicine skill or the ability to cast one or more spells that restore a creature’s hit points"
        ],
        "cost": 0
    },
    "scout": {
        "name": "Scout",
        "desc": "The scout acts as a lookout and alert to danger for the quest-goers, keeping watch for traps, hidden foes or important sights. The scout is quick on their feet and able to out manoeuvre most foes.",
        "passives": [
            {
                "name": "Nimble Step",
                "desc": "You can take the Dash action as a bonus action.<br>If you can already take the Dash action as a bonus action, you gain an additional 5 feet of movement."
            }
        ],
        "actives": {
            "flankingmanoeuvre": {
                "name": "Flanking Manoeuvre",
                "desc": "As a bonus action, you and any allies within 30 feet of you may move up to half your speed without provoking attacks of opportunity.",
                "cost": 5,
                "uses": 1
            }
        },
        "requirements": [
            "Proficiency in two of the following skills: Investigation, Perception, or Survival"
        ],
        "cost": 0
    },
    "standardbearer": {
        "name": "Standard-Bearer",
        "desc": "Keeping morale high, the standard-bearer holds sway over a Starblade Standard, a magical item that invokes power in those allied to it. The standard-bearer is linked to the item upon the quest’s commencing, and can activate it at any time.",
        "passives": [
            {
                "name": "Morale Boost",
                "desc": "When an allied creature within 30 feet of you rolls a saving throw, if they can see you, they may use their reaction to feel inspired by the standard, allowing them to add 1d4 to their saving throw result.<br>A creature may use this feature before or after they makes their roll, but before the outcome has been determined."
            }
        ],
        "actives": {
            "planttheflag": {
                "name": "Plant the Flag",
                "desc": "As a bonus action on your turn, you plant the Starblade Standard into the ground at your feet, releasing a wave of energy in a 30-foot radius around it that lasts for 1 minute.<br>Whilst an allied creature stands in the area, they gain the following benefits:<br><ul><li>Each creature gains advantage on saving throws against the charmed or frightened condition.</li><li>Each creature gains temporary hit points equal to 2 + its proficiency bonus at the start of each of its turns.</li><li>Each creature adds 1d4 to the first attack roll it makes on each of its turns.</li></ul>Whilst using your Plant the Flag role power, creatures must be within 30 feet of the Starblade Banner to gain the benefits of Morale Boost.<br>Once the effect ends, the standard can still provide Morale Boost in its area, but otherwise has no effects and is a nonmagical banner.",
                "cost": 10,
                "uses": 1
            }
        },
        "requirements": [
            "A Charisma score of 13 or higher"
        ],
        "cost": 0
    }
}
